trade_exp/src/InformationRegisters/НормыРабочегоВремени/НормыРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="413602ea-80a3-4725-aa64-5228c99ad381">
  <name>НормыРабочегоВремени</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="7cf78c8a-4996-4290-aca0-fd371b349f11">
    <name>НормаЧасовРаботыНаЧеловекаВДень</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="c5d0dfed-eb21-44e7-849f-98db3797221c">
    <name>ДеньНеделиСтрокой</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="b54f398b-8f04-496e-afe2-a46a44415412">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1304451b-5d05-4e61-ac2b-0511f05cf688">
    <name>ГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fc7c6fd6-e10b-4a20-8f94-c93c52f244e7">
    <name>ДеньНедели</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/УчетРабочегоВремениСотрудников/УчетРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="13d75dc0-9223-4b1b-beb4-cba8132abe50">
  <name>УчетРабочегоВремениСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="a44913b0-4063-4968-bf34-b77f64254b83">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="54b7c3ee-5669-4057-b209-a361d67c8bad">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0d926621-4d7d-40ed-8fec-80d57c83437a">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="58649832-c538-4ecf-98e0-7df52cfc2105">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СостоянияСотрудников/СостоянияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5c9d146-8f4a-45db-9b47-dc1f6c9559b2">
  <name>СостоянияСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b343c276-8ae6-43f0-b8dc-6404f67693a2">
    <name>Зашел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="33217620-5c33-4012-bc80-e5f910792d19">
    <name>Вышел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТабельУчетаРабочегоВремениСтатус/ТабельУчетаРабочегоВремениСтатус.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5d4dfabc-aa62-496a-bc64-1394b20f20a3">
  <name>ТабельУчетаРабочегоВремениСтатус</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="d8d05e98-3766-4fa1-b7d7-968a28afc3ee">
    <name>Утвержден</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7452e425-9821-4e29-8d02-1e4e22d80d7e">
    <name>УтвержденКАвансу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7d6c9219-772c-4557-9593-6385bda00220">
    <name>ПроверенБухгалтером</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="34543faf-6d40-411e-bf7f-5135f5c95982">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ВидыИспользованияРабочегоВремени/ВидыИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f1ae8166-42dc-403e-ade4-33ff8c5ffa11">
  <name>ВидыИспользованияРабочегоВремени</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="acc6c5fc-ea40-49c7-9b95-fe321dacfb63">
    <name>БуквенныйКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="904b8764-68fa-4dd2-8318-95808836ba08">
    <name>ЦифровойКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="866fd3b2-5c64-4822-bc8a-f5902da85af3">
    <name>ПолноеНаименование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="093c6e04-2aaa-4ec1-bf43-6fd223d6057c">
    <name>РабочееВремя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c290f0b-3296-4cb7-b939-8c081eb041f1">
    <name>Целосменное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="776c8fac-946b-4b5e-8e15-791244877470">
    <name>Сотрировка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/Отделы/Отделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="185e8ada-3ead-4fe0-ba9f-7aa6f38fdec9">
  <name>Отделы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="11e387f3-54db-4496-ad7b-06da8f792e73">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f190465-8417-419b-8aba-b08c44f1381c">
    <name>ГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a83eb5ec-5c8c-4666-ab48-1906e7d68823">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29965ef5-fb06-4b3d-9add-ecdd687031a0">
    <name>ИзменятьПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5f9d143-4a06-49e2-bb8d-855ab3318513">
    <name>ИзменятьТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8de732e-42ad-4635-a3a9-c2528b778cad">
    <name>УровеньДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9344b6ff-f02a-4c5b-ad60-a91807edf87e">
    <name>ЗапретитьСоздаватьПропуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="df94b4fc-8646-43ca-b344-fb1a1ce8f0f2">
    <name>ЦельПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="388216eb-779b-43cf-af83-f29c6389729f">
    <name>ИзменятьЦель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7181374d-e109-40a4-abc7-b447da5d30f4">
    <name>ИзменятьТребуетПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="662ddfb0-40cb-4323-9382-c3a57c6241b1">
    <name>УстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3fb68ed7-b552-4957-a4a7-308c80a4b197">
    <name>ИдентификаторАстерикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eaff3ee1-6abe-4021-b5fe-b1484b94e6d0">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="da752511-61de-4f01-a166-216839c92e11">
    <name>ВнутреннийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9f6d87ce-cb27-41e1-a72f-e5290739fc24">
    <name>КорпоративныйТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c64d903-4c47-4645-aa2a-dc29f8918424">
    <name>СписокЗон</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1111ed8c-d901-4d0e-8970-a72ac74d223d">
      <name>ЗонаДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/CommonModules/УчетРабочегоВремениСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокВидовВремениБуквенныйКод() Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВидыИспользованияРабочегоВремени.Ссылка КАК Ссылка,
	|	ВидыИспользованияРабочегоВремени.Наименование КАК Наименование,
	|	ВидыИспользованияРабочегоВремени.ПолноеНаименование КАК ПолноеНаименование,
	|	ВидыИспользованияРабочегоВремени.Сотрировка КАК Сотрировка,
	|	ВидыИспользованияРабочегоВремени.БуквенныйКод КАК БуквенныйКод,
	|	ВидыИспользованияРабочегоВремени.ЦифровойКод КАК ЦифровойКод
	|ИЗ
	|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
	|ГДЕ
	|	ВидыИспользованияРабочегоВремени.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрировка" ;
	
	Список= Новый СписокЗначений;
	
	Выборка= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Список.Добавить(Выборка.Ссылка, Выборка.БуквенныйКод);
	КонецЦикла;
	Возврат Список;
	
КонецФункции

Функция ПолучитьСписокВидовВремениСтруктурой(Текст) Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВидыИспользованияРабочегоВремени.Ссылка КАК Ссылка,
	|	ВидыИспользованияРабочегоВремени.Наименование КАК Наименование,
	|	ВидыИспользованияРабочегоВремени.ПолноеНаименование КАК ПолноеНаименование,
	|	ВидыИспользованияРабочегоВремени.Сотрировка КАК Сотрировка,
	|	ВидыИспользованияРабочегоВремени.БуквенныйКод КАК БуквенныйКод,
	|	ВидыИспользованияРабочегоВремени.ЦифровойКод КАК ЦифровойКод
	|ИЗ
	|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
	|ГДЕ
	|	ВидыИспользованияРабочегоВремени.ПометкаУдаления = ЛОЖЬ
	|	И ВидыИспользованияРабочегоВремени.БуквенныйКод ПОДОБНО &БуквенныйКод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрировка" ;
	
	Если Не ПустаяСтрока(Текст) Тогда
		Запрос.УстановитьПараметр("БуквенныйКод",Текст);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВидыИспользованияРабочегоВремени.БуквенныйКод ПОДОБНО &БуквенныйКод", "");
	КонецЕсли;
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	
	СП= Новый СписокЗначений;	
	Пока Выборка.Следующий() Цикл 
		СтркДанныеВыбора= Новый Структура("ВидВремени, БуквенноеОбозначение, Часы, ЕстьРазделитель", Выборка.Ссылка, Выборка.БуквенныйКод);
		СП.Добавить(СтркДанныеВыбора, "["+Выборка.БуквенныйКод+"] "+Выборка.Наименование);
	КонецЦикла;
	Возврат СП;
	
КонецФункции

Функция ПолучитьВидВремениЯвкаСтруктура() Экспорт
	ВидВремени= Справочники.ВидыИспользованияРабочегоВремени.Явка;
	Возврат Новый Структура("ВидВремени, БуквенноеОбозначение", ВидВремени, ВидВремени.БуквенныйКод);
КонецФункции

Функция ПолучитьВидВремениВыходной() Экспорт
	ВидВремени= Справочники.ВидыИспользованияРабочегоВремени.ВыходныеДни;
	Возврат Новый Структура("ВидВремени, БуквенноеОбозначение", ВидВремени, ВидВремени.БуквенныйКод);
КонецФункции

Функция ПолучитьВидВремениПоБуквенномуКоду(Текст) Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВидыИспользованияРабочегоВремени.Ссылка,
	|	ВидыИспользованияРабочегоВремени.Наименование,
	|	ВидыИспользованияРабочегоВремени.ПолноеНаименование,
	|	ВидыИспользованияРабочегоВремени.Сотрировка КАК Сотрировка,
	|	ВидыИспользованияРабочегоВремени.БуквенныйКод,
	|	ВидыИспользованияРабочегоВремени.ЦифровойКод
	|ИЗ
	|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
	|ГДЕ
	|	ВидыИспользованияРабочегоВремени.ПометкаУдаления = ЛОЖЬ
	|	И ВидыИспользованияРабочегоВремени.БуквенныйКод = &БуквенныйКод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрировка" ;
	
	Запрос.УстановитьПараметр("БуквенныйКод",Текст);
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Сообщить("Не верно введен Вид рабочего времени!");
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьМесяцПоДате(РедактируемыйОбъект, ПутьРеквизита, ПутьРеквизитаПредставления) Экспорт
	
	Значение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита);
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизитаПредставления, Формат(Значение, "ДФ='ММММ гггг'"));
	
КонецПроцедуры

Функция ПолучитьПредставлениеМесяца(ДатаНачалаМесяца) Экспорт
	
	Возврат Формат(ДатаНачалаМесяца, "ДФ='ММММ гггг'");
	
КонецФункции

Функция ПолучитьКоличествоСотрудниковВПодразделении(Отдел)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сотрудники.Ссылка) КАК Кол
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Отдел = &Отдел
	|	И Сотрудники.Уволен = ЛОЖЬ
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ" ;
	
	Запрос.УстановитьПараметр("Отдел",Отдел);
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Кол;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьВидДня(Дата)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата,
	|	ДанныеПроизводственногоКалендаря.ВидДня
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата = &Дата
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь" ;
	
	Запрос.УстановитьПараметр("Дата",НачалоДня(Дата));
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ"));
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидДня;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКоличествоДнейВМесяц(ДатаНачала, ДатаОкончания, ВидДня=Неопределено)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПроизводственногоКалендаря.Дата) КАК ДатаКол,
	|	ДанныеПроизводственногоКалендаря.ВидДня
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И ДанныеПроизводственногоКалендаря.ВидДня = &ВидДня
	|	И ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПроизводственногоКалендаря.ВидДня" ;
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации());
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Если ВидДня = Неопределено Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст, "И ДанныеПроизводственногоКалендаря.ВидДня = &ВидДня", "");
	Иначе 
		Запрос.УстановитьПараметр("ВидДня", ВидДня);
	КонецЕсли;
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаКол;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьРаботающихСотрудников(Отдел=Неопределено, ДатаНачалаПериода)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Пользователь КАК Пользователь,
	|	Сотрудники.Должность КАК Должность,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.ДатаПриема КАК ДатаПриема,
	|	Сотрудники.Отдел КАК Отдел,
	|	Сотрудники.Подразделение КАК Подразделение
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.Отдел В ИЕРАРХИИ(&Отдел)
	|	И ВЫБОР
	|			КОГДА Сотрудники.Уволен = ИСТИНА
	|				ТОГДА Сотрудники.ДатаУвольнения >= &ДатаНачалаПериода
	|			ИНАЧЕ Сотрудники.Уволен = ЛОЖЬ
	|		КОНЕЦ" ;
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода",ДатаНачалаПериода);

	Если Отдел = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Сотрудники.Отдел В ИЕРАРХИИ(&Отдел)", "");
	Иначе
		Запрос.УстановитьПараметр("Отдел",Отдел);
	КонецЕсли;
	Результат= Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСотрудников = Новый Массив;
	Пока Выборка.Следующий()Цикл
		СтрукСотрудника = Новый Структура("Сотрудник, Должность, Отдел, Подразделение");
		ЗаполнитьЗначенияСвойств(СтрукСотрудника, Выборка);
		МассивСотрудников.Добавить(СтрукСотрудника);
	КонецЦикла;
	
	Возврат МассивСотрудников;	
КонецФункции

Функция ПолучитьЧасыработыОрганизации(Календарь,КонецГрафика)  Экспорт
	
	ДатаНачала = НачалоМесяца(КонецГрафика);
	ДатаОкончания = КонецМесяца(КонецГрафика);

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Создаем временную таблицу расписаний.
	ГрафикиРаботы.СоздатьВТРасписанияРаботыНаПериод(МенеджерВременныхТаблиц, Календарь, ДатаНачала, ДатаОкончания);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДЕНЬ(РасписанияРаботы.ДатаГрафика) КАК НомерДня,
	|	СУММА(РАЗНОСТЬДАТ(РасписанияРаботы.ВремяНачала, РасписанияРаботы.ВремяОкончания, ЧАС)) КАК Часов
	|ИЗ
	|	ВТРасписанияРаботы КАК РасписанияРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	ДЕНЬ(РасписанияРаботы.ДатаГрафика)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДня" ;

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Результат = Запрос.Выполнить().Выгрузить();
	
	мРасписание = Новый Массив(Число(День(ДатаОкончания)));
	Для ДН = Число(День(ДатаНачала)) По Число(День(ДатаОкончания)) Цикл
		НовыйДень = Результат.Найти(ДН, "НомерДня");
		Если НовыйДень <> Неопределено Тогда
			мРасписание[ДН-1] = НовыйДень.Часов;
		Иначе
			мРасписание[ДН-1] = 0;
		КонецЕсли;
	КонецЦикла;
	Возврат мРасписание; 
	
КонецФункции

Функция ПолучитьНормыРабочегоВремени(ДатаСреза, Отдел, ГрафикРаботы)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	НормыРабочегоВремениСрезПоследних.ДеньНедели КАК ДеньНедели,
	|	НормыРабочегоВремениСрезПоследних.НормаЧасовРаботыНаЧеловекаВДень КАК НормаЧасов,
	|	НормыРабочегоВремениСрезПоследних.ДеньНеделиСтрокой
	|ИЗ
	|	РегистрСведений.НормыРабочегоВремени.СрезПоследних(
	|			&ДатаСреза,
	|			Отдел = &Отдел
	|				И ГрафикРаботы = &ГрафикРаботы) КАК НормыРабочегоВремениСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДеньНедели" ;
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Отдел", Отдел);
	Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикРаботы);
	
	мНормы= Новый Массив;
	
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		мНормы.Добавить(Выборка.НормаЧасов);
	КонецЦикла;
	Возврат мНормы;
	
КонецФункции

Функция ЗрегестрироватьСотрудникаПоШтрихкодуСервер(Штрихкод) Экспорт
	
	Ошибка= Ложь;
	Сотрудник= Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
	Событие= Перечисления.СостоянияСотрудников.Вышел;
	Результат= СотрудникВОфисе(Сотрудник);
	ПредыдущееСостояние= Результат.Состояние;
	ПериодПредудущегоСобытия= Результат.Период;
	
	Если (ПериодПредудущегоСобытия+5*60) >= ТекущаяДата() Тогда
		Ошибка= Истина;
		Сообщить("Между последним сконированием прошло меньше 5 минут!");
		Событие= ПредыдущееСостояние;
		Возврат  Новый Структура("Событие, Ошибка", Событие, Ошибка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		НаборЗаписей= РегистрыСведений.УчетРабочегоВремениСотрудников.СоздатьНаборЗаписей();
		НоваяЗапись= НаборЗаписей.Добавить();
		НоваяЗапись.Период= ТекущаяДата();
		НоваяЗапись.Сотрудник= Сотрудник;
		НоваяЗапись.Пользователь= Сотрудник.Пользователь;
		НоваяЗапись.Подразделение= ?(ЗначениеЗаполнено(Сотрудник.Подразделение), Сотрудник.Подразделение, Сотрудник.Пользователь.ТекущееПодразделение);
		
		//Если последнее событие было вчера или позднее тогда всегда зашел
		Если НачалоДня(ПериодПредудущегоСобытия) < НачалоДня(ТекущаяДата()) Тогда
			НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
		Иначе
			// Общая проверка
			Если  ПредыдущееСостояние = Перечисления.СостоянияСотрудников.Вышел Тогда//Вышел или ещё не было
				НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
			Иначе
				НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Вышел;
			КонецЕсли;
		КонецЕсли;
		Событие= НоваяЗапись.Событие;
		
		НаборЗаписей.Записать(Ложь);
	Иначе 
		Ошибка= Истина;
		Сообщить("Сотрудник со штрихкодом "+Штрихкод+" не найден!")
	КонецЕсли;
	
	Возврат  Новый Структура("Событие, Ошибка", Событие, Ошибка);
	
КонецФункции

Функция СотрудникВОфисе(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетРабочегоВремениСотрудниковСрезПоследних.Событие,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.УчетРабочегоВремениСотрудников.СрезПоследних(
	|			,
	|			Сотрудник = &Сотрудник
	|				И Подразделение = &Подразделение
	|				И Пользователь = &Пользователь) КАК УчетРабочегоВремениСотрудниковСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Сотрудник.Подразделение);
	Запрос.УстановитьПараметр("Пользователь", Сотрудник.Пользователь);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если  ВыборкаДетальныеЗаписи.Событие = Перечисления.СостоянияСотрудников.Зашел Тогда
			Состояние= Перечисления.СостоянияСотрудников.Зашел;
			Период= ВыборкаДетальныеЗаписи.Период;
		Иначе
			Состояние= Перечисления.СостоянияСотрудников.Вышел;
			Период= ВыборкаДетальныеЗаписи.Период;
		КонецЕсли;
	Иначе
		Состояние= Перечисления.СостоянияСотрудников.Вышел;
		Период= Дата(0001,01,01);;
	КонецЕсли;
		Рез= Новый Структура("Состояние,Период", Состояние, Период);
	Возврат  Рез;
	
КонецФункции	

//Дополнительные процедуры и функции
Процедура ТабельЗаполнитьДанныеПоСотрудникам(Объект, СписокСотрудников, СтрокиПоСотрудникам, ДатаОкончанияРасчета, ПоГрафику) Экспорт
	
	КодыВидовВремени = КодыВидовВремени(Объект.ПериодРегистрации);
	
	Если ПоГрафику Тогда
		ВыборкаДанныхОВремени = ВыборкаДанныхПоГрафику(СписокСотрудников, ДатаОкончанияРасчета,Объект.ГрафикРаботы);	
	Иначе
		ВыборкаДанныхОВремени = ВыборкаДанныхОВремени(Объект, СписокСотрудников, ДатаОкончанияРасчета);
	КонецЕсли;
	
	ТекущийСотрудник = Неопределено;
	ДанныеОВремениПоСотруднику = Новый Массив;
	НомерСтрокиСотрудник = 1;
	ИТ = Объект.Отделы.НайтиСтроки(Новый Структура("Отдел", Справочники.Отделы.НайтиПоКоду("000000148"))).Количество() > 0; 
	
	ДанныеОВремениПоСотруднику = Новый ТаблицаЗначений;
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Сотрудник");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("ВидУчетаВремени");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Дата");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("ДатаНачалаРаботы");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Часы");
	
	Пока ВыборкаДанныхОВремени.СледующийПоЗначениюПоля("Сотрудник") Цикл
		ДанныеОВремениПоСотруднику.Очистить();
		Пока ВыборкаДанныхОВремени.Следующий() Цикл
			СтрокаТаблицыДанныхОВремени = ДанныеОВремениПоСотруднику.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДанныхОВремени, ВыборкаДанныхОВремени)
		КонецЦикла;	
		
		Если СтрокиПоСотрудникам <> Неопределено Тогда					
			МассивСтрокПоСотруднику = СтрокиПоСотрудникам[ВыборкаДанныхОВремени.Сотрудник];
		КонецЕсли;	
		
		ТабельЗаполнитьСтрокиПоСотруднику(
		    Объект.ДанныеОВремени,
			ДанныеОВремениПоСотруднику, 
			МассивСтрокПоСотруднику, 
			КодыВидовВремени, ПоГрафику, Объект.ГрафикРаботы, Объект.Ссылка, ИТ);
	КонецЦикла;
		
КонецПроцедуры	

Функция КодыВидовВремени(Месяц = Неопределено) Экспорт  
	
	Выборка = СформироватьЗапросПоВидамВремени().Выбрать();
	
	КодыВидовВремени = Новый Соответствие;
	
	БуквенныйКодИмяРеквизита = "БуквенныйКод";
	
	Пока Выборка.Следующий() Цикл 
		КодыВидовВремени.Вставить(Выборка.ВидВремени, Выборка[БуквенныйКодИмяРеквизита]);
	КонецЦикла;	
	
	КодыВидовВремени.Вставить(Справочники.ВидыИспользованияРабочегоВремени.ПустаяСсылка(), "");
	
	Возврат КодыВидовВремени; 
	
КонецФункции

Функция СформироватьЗапросПоВидамВремени() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыИспользованияРабочегоВремени.Ссылка КАК ВидВремени,
	|	ВидыИспользованияРабочегоВремени.БуквенныйКод, 
	|	ВидыИспользованияРабочегоВремени.Целосменное,
	|	ВидыИспользованияРабочегоВремени.Наименование
	|ИЗ
	|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ВыборкаДанныхПоГрафику(СписокСотрудников = Неопределено, ДатаОкончанияРасчета, График);	
	УстановитьПривилегированныйРежим(истина);	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Дата",Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Часы",Новый ОписаниеТипов("Число"));
	
	мЧасыРаботыПоГрафику = ПолучитьЧасыработыОрганизации(График,ДатаОкончанияРасчета); 
	КолДнейВМес = День(ДатаОкончанияРасчета);

	Для НомерДня = 1 По КолДнейВМес Цикл
		ТекДата = Дата(Год(ДатаОкончанияРасчета),Месяц(ДатаОкончанияРасчета), НомерДня);
		ДеньНедели = ДеньНедели(ТекДата);
			
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Дата = ТекДата;
		НоваяСтрока.Часы = мЧасыРаботыПоГрафику[НомерДня-1];
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешняяТаблица.Дата КАК Дата,
		|	ВнешняяТаблица.Часы КАК Часы
		|ПОМЕСТИТЬ ВнешняяТаблица
		|ИЗ
		|	&ВнешняяТаблица КАК ВнешняяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.Пользователь КАК Пользователь,
		|	Сотрудники.Подразделение КАК Подразделение,
		|	ВнешняяТаблица.Дата КАК Дата,
		|	ВнешняяТаблица.Часы КАК Часы
		|ПОМЕСТИТЬ ВР_СотрудникиВремя
		|ИЗ
		|	ВнешняяТаблица КАК ВнешняяТаблица,
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&Ссылка)
		|	И ВнешняяТаблица.Дата >= Сотрудники.ДатаПриема
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_СотрудникиВремя.Сотрудник КАК Сотрудник,
		|	ВР_СотрудникиВремя.Пользователь КАК Пользователь,
		|	ВР_СотрудникиВремя.Подразделение КАК Подразделение,
		|	ВР_СотрудникиВремя.Дата КАК Дата,
		|	ВР_СотрудникиВремя.Часы КАК Часы,
		|	ВЫБОР
		|		КОГДА НЕ СостоянияСотрудников.Состояние ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком)
		|						ТОГДА ""ОЖ""
		|					КОГДА СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоБеременностиИРодам)
		|						ТОГДА ""Р""
		|				КОНЕЦ
		|	КОНЕЦ КАК ВидУчетаВремени
		|ИЗ
		|	ВР_СотрудникиВремя КАК ВР_СотрудникиВремя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
		|		ПО ВР_СотрудникиВремя.Сотрудник = СостоянияСотрудников.Сотрудник
		|			И (СостоянияСотрудников.Период = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ))
		|			И (ВР_СотрудникиВремя.Дата МЕЖДУ СостоянияСотрудников.ДатаНачала И СостоянияСотрудников.ДатаОкончания)";
	//	|			И (СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком))";
	
	Запрос.УстановитьПараметр("Ссылка", СписокСотрудников);  
	Запрос.УстановитьПараметр("Период", ДатаОкончанияРасчета);
    Запрос.УстановитьПараметр("ВнешняяТаблица", ТЗ);
	УстановитьПривилегированныйРежим(ложь);
	Возврат Запрос.Выполнить().Выбрать(); 
	
КонецФункции

Функция ВыборкаДанныхОВремени(ДанныеТабеля, СписокСотрудников = Неопределено, ДатаОкончанияРасчета) 
	
	ТекстЗапроса = "ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_Сотрудники
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&Сотрудник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&нПериода, ДЕНЬ, aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d) КАК Период
		|ПОМЕСТИТЬ ВТ_ТаблицаДат
		|{ВЫБРАТЬ
		|	Период}
		|ИЗ
		|	(ВЫБРАТЬ
		|		0 КАК a
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		1
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		2
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		3
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		4
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		5
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		6
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		7
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		8
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		9) КАК aa
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			0 КАК b
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			1
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			2
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			3
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			4
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			5
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			6
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			7
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			8
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			9) КАК bb
		|		ПО (ИСТИНА)
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			0 КАК c
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			1
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			2
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			3
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			4
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			5
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			6
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			7
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			8
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			9) КАК cc
		|		ПО (ИСТИНА)
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			0 КАК d
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			1
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			2
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			3
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			4
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			5
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			6
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			7
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			8
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			9) КАК dd
		|		ПО (ИСТИНА)
		|ГДЕ
		|	aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d <= РАЗНОСТЬДАТ(&нПериода, &кПериода, ДЕНЬ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетРабочегоВремениСотрудников.Сотрудник КАК Сотрудник,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА УчетРабочегоВремениСотрудников.Событие = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудников.Зашел)
		|				ТОГДА УчетРабочегоВремениСотрудников.Период
		|		КОНЕЦ) КАК ДатаНачалаРаботы,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА УчетРабочегоВремениСотрудников.Событие = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудников.Вышел)
		|				ТОГДА УчетРабочегоВремениСотрудников.Период
		|		КОНЕЦ) КАК ДатаОкончанияРаботы,
		|	НАЧАЛОПЕРИОДА(УчетРабочегоВремениСотрудников.Период, ДЕНЬ) КАК Период,
		|	NULL КАК ВидУчетаВремени
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.УчетРабочегоВремениСотрудников КАК УчетРабочегоВремениСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК Сотр
		|		ПО УчетРабочегоВремениСотрудников.Сотрудник = Сотр.Сотрудник
		|ГДЕ
		|	УчетРабочегоВремениСотрудников.Период МЕЖДУ &нПериода И &кПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетРабочегоВремениСотрудников.Сотрудник,
		|	НАЧАЛОПЕРИОДА(УчетРабочегоВремениСотрудников.Период, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СостоянияСотрудников.Сотрудник,
		|	НАЧАЛОПЕРИОДА(ВТ_ТаблицаДат.Период, ДЕНЬ),
		|	КОНЕЦПЕРИОДА(ВТ_ТаблицаДат.Период, ДЕНЬ),
		|	НАЧАЛОПЕРИОДА(ВТ_ТаблицаДат.Период, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком)
		|			ТОГДА ""ОЖ""
		|		КОГДА СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоБеременностиИРодам)
		|			ТОГДА ""Р""
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
		|		ПО (ВТ_ТаблицаДат.Период МЕЖДУ СостоянияСотрудников.ДатаНачала И СостоянияСотрудников.ДатаОкончания)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК Сотр
		|		ПО СостоянияСотрудников.Сотрудник = Сотр.Сотрудник
		|ГДЕ
		|	СостоянияСотрудников.Период = &нПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДат.Период КАК Дата,
		|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ_ТаблицаДат.Период = ВременнаяТаблица.Период
		|				ТОГДА ВременнаяТаблица.ДатаНачалаРаботы
		|		КОНЕЦ) КАК ДатаНачалаРаботы,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ_ТаблицаДат.Период = ВременнаяТаблица.Период
		|				ТОГДА ВременнаяТаблица.ДатаОкончанияРаботы
		|		КОНЕЦ) КАК ДатаОкончанияРаботы,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НЕ ВременнаяТаблица.ВидУчетаВремени ЕСТЬ NULL
		|				ТОГДА 0
		|			КОГДА ВТ_ТаблицаДат.Период = ВременнаяТаблица.Период
		|				ТОГДА ВЫБОР
		|						КОГДА ВременнаяТаблица.ДатаНачалаРаботы ЕСТЬ NULL
		|								ИЛИ ВременнаяТаблица.ДатаОкончанияРаботы ЕСТЬ NULL
		|							ТОГДА 0
		|						ИНАЧЕ ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ВременнаяТаблица.ДатаНачалаРаботы, ВременнаяТаблица.ДатаОкончанияРаботы, МИНУТА) - 60) / 60 - 0.49 КАК ЧИСЛО(10, 0))
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Часы,
		|	ВременнаяТаблица.ВидУчетаВремени КАК ВидУчетаВремени
		|ИЗ
		|	ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
		|		ПО ВТ_ТаблицаДат.Период >= ВТ_Сотрудники.Сотрудник.ДатаПриема
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
		|		ПО ВТ_ТаблицаДат.Период = ВременнаяТаблица.Период
		|			И ВТ_Сотрудники.Сотрудник = ВременнаяТаблица.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТаблицаДат.Период,
		|	ВТ_Сотрудники.Сотрудник,
		|	ВременнаяТаблица.ВидУчетаВремени";
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("кПериода", ДатаОкончанияРасчета);
	Запрос.УстановитьПараметр("нПериода", НачалоМесяца(ДанныеТабеля.ПериодРегистрации));
	Запрос.УстановитьПараметр("Сотрудник", СписокСотрудников);

	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ТабельЗаполнитьСтрокиПоСотруднику(ДанныеОВремени, ДанныеОВремениПоСотруднику, МассивСтрокПоСотруднику, КодыВидовВремени, ПоГрафику, Календарь = Ложь, ДокументСсылка = Неопределено, ИТ = Ложь) Экспорт 
	
	Календарь_Ссылка = Справочники.Календари.ПолучитьСсылку(Новый УникальныйИдентификатор("91df52ef-4f67-11e4-80c7-002590e168ab"));
	УстановленПлавающийГрафик = Календарь.Ссылка = Справочники.Календари.НайтиПоНаименованию("Плавающий график");
	Явка = Справочники.ВидыИспользованияРабочегоВремени.Явка;
	Выходной = Справочники.ВидыИспользованияРабочегоВремени.ВыходныеДни;
	Декрет=Справочники.ВидыИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком; 
	ПоБеременности=Справочники.ВидыИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам; 
	Табель = ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремени");   
	ЗапретИзмененияДо15Числа = Табель И ДокументСсылка.Статус = ПредопределенноеЗначение("Перечисление.ТабельУчетаРабочегоВремениСтатус.УтвержденКАвансу");
	
	ВидВремени = Справочники.ВидыИспользованияРабочегоВремени.ПустаяСсылка();
	
	Для Каждого СтрокаДанныхОВремени Из ДанныеОВремениПоСотруднику Цикл  
		
		НомерДня = День(СтрокаДанныхОВремени.Дата);
		
		Если ЗапретИзмененияДо15Числа И НомерДня <= 15 Тогда
			Продолжить;
		КонецЕсли;
			
		НомерВидаВремениНаДату = 1;
		СтрокаТабеля = МассивСтрокПоСотруднику[НомерВидаВремениНаДату - 1];
		
		Если Не РучнаяКорректировкаВремени(СтрокаДанныхОВремени, ДанныеОВремени, ПоГрафику, Табель, УстановленПлавающийГрафик, ИТ) Тогда
			если СтрокаДанныхОВремени.ВидУчетаВремени="ОЖ" тогда
				ВидВремени = Декрет; 
				СтрокаДанныхОВремени.Часы = 0;                   
			иначеесли СтрокаДанныхОВремени.ВидУчетаВремени="Р" тогда	
				ВидВремени = ПоБеременности; 
				СтрокаДанныхОВремени.Часы = 0;                   
			иначеЕсли ЗначениеЗаполнено(СтрокаДанныхОВремени.Часы) Тогда
				ВидВремени = Явка;           
			Иначеесли не ЗначениеЗаполнено(СтрокаДанныхОВремени.ВидУчетаВремени) и не ЗначениеЗаполнено(СтрокаДанныхОВремени.Часы) тогда
				ВидВремени = Выходной;
				СтрокаДанныхОВремени.Часы = 0;
			КонецЕсли;
			
			Если ПоГрафику и (Календарь.Ссылка = Календарь_Ссылка) Тогда
				ВидДня = УчетРабочегоВремениСервер.ПолучитьВидДня(СтрокаДанныхОВремени.Дата);
				Если ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий") Тогда
				ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный") Тогда
					Если (СтрокаДанныхОВремени.Часы >= 1) тогда
					 СтрокаДанныхОВремени.Часы = СтрокаДанныхОВремени.Часы - 1;
					Конецесли; 
				Иначеесли не ЗначениеЗаполнено(СтрокаДанныхОВремени.ВидУчетаВремени) тогда
					ВидВремени = Выходной;
					СтрокаДанныхОВремени.Часы = 0;
				Конецесли;
			Конецесли;
			
			ЗаполняетсяПлан = ?(Табель И ПоГрафику И УстановленПлавающийГрафик И НЕ ИТ, Истина, Ложь);
			
			Если НЕ ЗаполняетсяПлан Тогда
				СтрокаТабеля["ВидВремени" + НомерДня] = ВидВремени;
			КонецЕсли;
			
			ДополнениеИмениКолонки = ?(ЗаполняетсяПлан, "План", "");
			СтрокаТабеля["Часов" + ДополнениеИмениКолонки + НомерДня] = СтрокаДанныхОВремени.Часы;
			СтрокаТабеля["Представление" + ДополнениеИмениКолонки + НомерДня] = ТабельПредставлениеВремениПоВиду(КодыВидовВремени.Получить(ВидВремени), СтрокаДанныхОВремени.Часы);  
		КонецЕсли;
		
		НачалоСмены = СтрокаДанныхОВремени.ДатаНачалаРаботы;
		Если Табель И Не ПоГрафику И ЗначениеЗаполнено(НачалоСмены) Тогда
			СтрокаТабеля["НачалоСмены" + НомерДня] = Дата('00010101') + (НачалоСмены - НачалоДня(НачалоСмены)) ;
		КонецЕсли;
		
	КонецЦикла;	
		
	КоличествоСтрокПоСотруднику = МассивСтрокПоСотруднику.Количество();
	
	Сотрудник = МассивСтрокПоСотруднику[0].Сотрудник;
	
	Для Каждого СтрокаПоСотруднику Из МассивСтрокПоСотруднику Цикл
		СтрокаПоСотруднику.Сотрудник = Сотрудник;		
	КонецЦикла;	
	
КонецПроцедуры	

Функция РучнаяКорректировкаВремени(ДанныеПоСтроке, ДанныеОВремени, ПоГрафику = Неопределено, Табель = Неопределено, Плавающий = Ложь, ИТ = Ложь) Экспорт
	
	Представление = ?(Табель И ПоГрафику И Плавающий И НЕ ИТ, "ПредставлениеПлан", "Представление");
	Отбор = Новый Структура;
	Отбор.Вставить("Сотрудник",ДанныеПоСтроке.Сотрудник);
	МассивСтрок = ДанныеОВремени.НайтиСтроки(Отбор);
	Для каждого Строка из МассивСтрок Цикл	
		Если ЗначениеЗаполнено(Строка[Представление + День(ДанныеПоСтроке.Дата)]) Тогда
			Возврат Истина;
			Прервать;
		Иначе
			Возврат Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
КонецФункции

Функция ТабельПредставлениеВремениПоВиду(ОбозначениеВремени, КоличествоЧасов) Экспорт 
	
	Если Не ПустаяСтрока(ОбозначениеВремени) Или КоличествоЧасов <> 0 Тогда
		Возврат ОбозначениеВремени + Формат(КоличествоЧасов, "ЧГ=");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти
